{

/* Languages */
"English" = "English";

/* Action keys */
"PropertyKey.deleteAction" = "Delete";
"PropertyKey.editAction" = "Edit";
"PropertyKey.inspectAction" = "Inspect";
"PropertyKey.selectAction" = "Select";

/* Additional Page Titles */
"PageTitle.DefaultPageTitle" = "Welcome to Direct to Web!";
"PageTitle.Error" = "Error";
"PageTitle.MailUserReset" = "A password reminder from Direct to Web!";
"PageTitle.UserCreation" = "Create a new @@displayNameForEntity@@";
"PageTitle.UserReset" = "Password reminder";
"PageTitle.UserLogin" = "Login";

/* List sorting */
"ERXSortOrder.sortBy" = "Click to sort by this column";
"R2DSortOrder.sortAsc" = "Click to sort every @@displayNameForEntity@@ by @@displayNameForProperty@@ in ascending order.";
"R2DSortOrder.sortDesc" = "Click to sort every @@displayNameForEntity@@ by @@displayNameForProperty@@ in descending order.";
"R2D2W.sortAscending" = "^";
"R2D2W.sortDescending" = "v";
"R2D2W.unsorted" = "x";

/* Localized Operators */
"=" = "=";
"<>" = "≠";
"<" = "<";
">" = ">";
"<=" = "≤";
">=" = "≥";
"contains" = "contains";
"ends with" = "ends with";
"is" = "is";
"like" = "is like";
"starts with" = "starts with";

/* Localized Date-Time Formatters */
/* http://java.sun.com/j2se/1.5.0/docs/api/java/text/SimpleDateFormat.html */
"R2D2W.dateFormat" = "MM/dd/yyyy";
"R2D2W.dateTimeFormat" = "MM/dd/yyyy hh:mm:ss a";

"R2D2W.dayCaptionFormat" = "MMM d, yyyy";
"R2D2W.monthCaptionFormat" = "MMMMM yyyy";
"R2D2W.weekCaptionFormat" = "MM/dd/yyyy";
"R2D2W.yearCaptionFormat" = "yyyy";

"R2D2W.dayHeaderFormat" = "EEE, MMM d";
"R2D2W.monthHeaderFormat" = "EEEE";
"R2D2W.weekHeaderFormat" = "EEEE";
"R2D2W.yearHeaderFormat" = "E";


/* Localized Date-Time Formatter Hints */
"R2D2W.dateFormatHint" = "(MM/DD/YYYY)";
"R2D2W.dateTimeFormatHint" = "(MM/DD/YYYY hh:mm:ss PM)";

/* Localized Number Formats */
/* http://java.sun.com/docs/books/tutorial/i18n/format/decimalFormat.html */
"R2D2W.defaultNumberHint" = "(Number)";

/* R2D2WDisplayBoolean */
"R2D2W.trueString" = "Yes";
"R2D2W.falseString" = "No";

/* Help Strings */
"R2D2W.displayToManyFault.helpString" = "View the @@displayNameForProperty@@ items linked to this @@displayNameForEntity@@.";
"R2D2W.displayToOneFault.helpString" = "View the @@displayNameForProperty@@ linked to this @@displayNameForEntity@@.";
"R2D2W.editToManyFault.helpString" = "Edit the @@displayNameForProperty@@ items linked to this @@displayNameForEntity@@.";
"R2D2W.editToOneFault.helpString" = "Edit the @@displayNameForProperty@@ linked to this @@displayNameForEntity@@.";
"R2D2W.inspectGlobalID.helpString" = "View this @@displayNameForEntityOfGlobalID@@.";

/* R2D2WEditLargeString */
"R2D2W.maxLengthMessage" = "(You may enter up to @@maxLength@@ characters.)";

/* Messages */
"CouldNotSave" = "Could not save your changes: @@message@@";
"CouldNotSavePleaseReapply" = "Could not save your changes. The @@displayNameForEntity@@ has changed in the database before you could save. Your changes have been lost. Please reapply them.";
"ERD2W.cancelCreationMessage" = "<b>Are you sure you want to stop creating this @@displayNameForEntity@@?</b><br><br>Clicking confirm will discard all your changes, Clicking Cancel will go back to editing your @@displayNameForEntity@@.";
"R2D2W.noUserEntityMessage" = "No entity is configured as a user entity.";

/* Button/Link Labels */
"ERD2W.addButtonLabel" = "Add";
"ERD2W.cancelButtonLabel" = "Cancel";
"ERD2W.clearButtonLabel" = "Clear";
"ERD2W.createButtonLabel" = "Create";
"ERD2W.deleteButtonLabel" = "Delete";
"ERD2W.deleteSelectedButtonLabel" = "Delete Selected";
"ERD2W.editButtonLabel" = "Edit";
"ERD2W.findButtonLabel" = "Find";
"ERD2W.inspectButtonLabel" = "Inspect";
"ERD2W.nextButtonLabel" = "Next";
"ERD2W.noButtonLabel" = "No";
"ERD2W.noSelectionString" = "- none -";
"ERD2W.okButtonLabel" = "OK";
"ERD2W.pickButtonLabel" = "Select";
"ERD2W.previousButtonLabel" = "Previous";
"ERD2W.removeButtonLabel" = "Remove";
"ERD2W.returnButtonLabel" = "Return";
"ERD2W.saveButtonLabel" = "Save";
"ERD2W.yesButtonLabel" = "Yes";

"R2D2W.createUserButtonLabel" = "Create Account";
"R2D2W.editAccountButtonLabel" = "Account Settings";
"R2D2W.loginButtonLabel" = "Login";
"R2D2W.logoutButtonLabel" = "Logout";
"R2D2W.moreOptionsButtonLabel" = "More Options";
"R2D2W.passwordResetButtonLabel" = "Forgot Password";
"R2D2W.podcastButtonLabel" = "Podcast";
"R2D2W.queryAllButtonLabel" = "Find any entity...";
"R2D2W.resetButtonLabel" = "Mail Reminder";
"R2D2W.rssButtonLabel" = "RSS";
"R2D2W.todayButtonLabel" = "Today";
"R2D2W.dayButtonLabel" = "Day";
"R2D2W.weekButtonLabel" = "Week";
"R2D2W.monthButtonLabel" = "Month";
"R2D2W.yearButtonLabel" = "Year";
"R2D2W.inspectGlobalID.buttonLabel" = "@@displayNameForEntityOfGlobalID@@ (@@primaryKeyStringForGlobalID@@)";

/* Button/Link Titles */
"R2D2W.podcastButtonTitle" = "Click to open this podcast in iTunes.";
"R2D2W.rssButtonTitle" = "Click to view this page as an RSS feed.";

/* Field Labels */
"R2D2W.maximumDateFieldLabel" = "Latest @@displayNameForProperty@@";
"R2D2W.minimumDateFieldLabel" = "Earliest @@displayNameForProperty@@";
"R2D2W.maximumNumberFieldLabel" = "Maximum @@displayNameForProperty@@";
"R2D2W.minimumNumberFieldLabel" = "Minimum @@displayNameForProperty@@";

/* Task Banners */
"ERD2W.tasks.confirm" = "Please confirm";
"ERD2W.tasks.edit" = "Edit @@displayNameForEntity@@: @@object.userPresentableDescription@@";
"ERD2W.tasks.editRelationship" = "Edit relationship for @@displayNameForEntity@@";
"ERD2W.tasks.edit.wizard" = "Create @@displayNameForEntity@@";
"ERD2W.tasks.error" = "Error";
"ERD2W.tasks.inspect" = "Inspect @@displayNameForEntity@@: @@object.userPresentableDescription@@";
"ERD2W.tasks.list" = "List @@displayNameForEntity@@";
"ERD2W.tasks.list.calendar" = "@@displayNameForEntity@@ Calendar";
"ERD2W.tasks.message" = "Attention";
"ERD2W.tasks.query" = "Find @@displayNameForEntity@@";
"ERD2W.tasks.query.login" = "Login";
"ERD2W.tasks.query.reset" = "Password Reminder";
"ERD2W.tasks.queryAll" = "Find Entities";
"ERD2W.tasks.select" = "Select @@displayNameForEntity@@";
"ERD2W.tasks.select.add" = "Select the @@displayNameForEntity@@ to add";

/* Other Localized Strings By Component */
"ERD2WCreateWizard.cancel" = "Cancel";
"ERD2WCreateWizard.nextStep" = "Next Step";
"ERD2WCreateWizard.previousStep" = "Previous Step";
"ERD2WCreateWizard.save" = "Save";
"ERD2WInspect.alreadyAborted" = "<b>You already aborted this operation</b>. Please hit cancel and try again from the first step";
"ERD2WInspectPage.cancel" = "Cancel";
"ERD2WInspectPage.return" = "Return";
"ERD2WInspectPage.saveChanges" = "Save";
"ERD2WList.confirmDeletionMessage" = "Are you sure you want to delete the following @@displayNameForEntity@@? This action cannot be undone.";
"ERD2WQueryPage.plainMessage" = "@@displayNameForEntity@@";
"ERD2WQueryPage.restrictedMessage" = "@@displayNameForEntity@@ (max @@fetchLimit@@)";
"ERD2WQueryToManyField.is" = "is";
"ERD2WQueryToManyField.where" = "where";
"ERD2WQueryToOneField.is" = "is";
"ERD2WQueryToOneField.where" = "where";
"ERD2WWizardCreationPage.stepsMessage" = "Step @@currentStep@@ of @@tabSectionsContents.count@@";
"ERDDatePopup.monthList" = ("Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec");
"ERDDefaultCancelCreationMessageAssignment.cancelCreationMessage" = "<B>Are you sure you want to stop creating this @@displayNameForEntity@@?</B><br><br>Clicking confirm will discard all your changes, Clicking Cancel will go back to editing your @@displayNameForEntity@@.";
"ERDDisplayImageIfExists.message" = "No Picture Available";
"ERDEditDatePopupOrNull.none" = "None";
"ERDEditDatePopupOrNull.or" = "- or -";
"ERDEditFile.deleteButton" = "Delete File";
"ERDEditFile.selectButton" = "Select File";
"ERDEditFile.selectMessage" = "Select a file on you local disk:";
"ERDEditFile.uploadButton" = "Upload File";
"ERDEditFile.uploadMessage" = "Upload the file to the server:";
"ERDEditList.saveLabel" = "Save @@pluralCount@@ @@pluralString@@?";
"ERDEditListButton.editButtonName" = "Edit @@displayNameForProperty@@ List";
"ERDEditPasswordConfirm.confirmLabel" = "Confirm Password";
"ERDEditPasswordConfirm.confirmNewLabel" = "Confirm New Password";
"ERDEditPasswordConfirm.infoMessage" = "<i>Please note: Both login and password are case sensitive. We require passwords to be from 6 to 16 characters with at least one numeric character.</i>";
"ERDEditPasswordConfirm.newPasswordLabel" = "New password";
"ERDEditPasswordConfirm.passwordLabel" = "Password";
"ERDEditStringWithChoices.noSelectionString" = "None";
"ERDEditToManyRelationship.add" = "Add";
"ERDEditToManyRelationship.delete" = "Delete selected";
"ERDEditToManyRelationship.remove" = "Remove";
"ERDEmptyListMessage.createObjectStringTemplate" = "Create New Entry";
"ERDEmptyListMessage.emptyEmbeddedListMessage" = "No matching @@displayNameForDestinationEntity@@ records found.";
"ERDEmptyListMessage.emptyListMessage" = "No matching @@displayNameForEntity@@ records found.";
"ERDInspect.clear" = "Clear";
"ERDInspect.create" = "Create";
"ERDInspect.objectUnsetMessage" = "No @@displayNameForDestinationEntity@@ set.";
"ERDInspect.select" = "Select...";
"ERDList.create" = "Add";
"ERDQueryAnyKey.matches" = "matches";
"ERDQueryDateRangeJavaScript.and" = "and";
"ERDQueryDateRangeJavaScript.between" = "between";
"ERDQueryTwoLevelRelationship.all" = "- all -";
"ERDTrashcan.confirmDeletionMessage" = "<b>Are you sure you want to delete the following @@displayNameForEntity@@?</b>";

"R2D2WDisplayEmptyFile.noAttachmentAvailable" = "No Attachment Available";
"R2D2WEditPassword.confirmPasswordLabel" = "Confirm @@displayNameForProperty@@";
"R2D2WEditPassword.confirmToolTip" = "Please re-enter @@displayNameForProperty@@ to confirm.";
"R2D2WInspectPage.emptyObjectMessage" = "No @@displayNameForEntity@@ was found.";
"R2D2WListRSSPage.defaultChannelDescription" = "No Description Available";
"R2D2WListRSSPage.defaultChannelTitle" = "No Title Available";
"R2D2WPlainTextInspectPage.keyValueSeparator" = ": ";

/* R2DBatchNavigationBar */
"R2DBatchNavigationBar.previous" = "«";
"R2DBatchNavigationBar.next" = "»";
"ERXBatchNavigationBar.items_per_page" = "items/page";
"ERXBatchNavigationBar.of" = "of";
"ERXBatchNavigationBar.page" = "Page number";

/* R2D2WCalendarNavigationBar */
"R2D2WCalendarNavigationBar.format" = "MM/dd/yyyy";
"R2D2WCalendarNavigationBar.gotoLabel" = "Go to Date";
"R2D2WCalendarNavigationBar.next" = "»";
"R2D2WCalendarNavigationBar.previous" = "«";

/* Messages */
"R2D2W.defaultAltText" = "No alternative text description available.";
"R2D2W.invalidLoginCredentials" = "Incorrect @@displayNameForUserID@@ and @@displayNameForUserCredential@@ combination.";
"R2D2W.missingLoginCredentials" = "Please enter your @@displayNameForUserID@@ and @@displayNameForUserCredential@@.";
"R2D2W.noUserAddressFound" = "No email address could be found for that @@displayNameForUserID@@!";
"R2D2W.noUserFound" = "Nothing found for that @@displayNameForUserID@@.";
"R2D2W.messageSent" = "Your message has been sent!";
"R2D2W.missingUserIDForReminder" = "Please enter your @@displayNameForUserID@@.";
"R2D2W.newEODescription" = "New @@displayNameForEntity@@";
"R2D2W.passwordReminderMessage" = "This is a password reminder message.";
"R2D2W.passwordReminderSubject" = "Password Reminder";
"R2D2W.propertyWithLocale" = "@@displayNameForProperty@@ (@@language@@)";

}